{"jobs": [{"title": "Applied Software Engineer II", "company": "Civis Analytics", "location": "United States", "description": "Applied Software Engineer II\r\nCivis Analytics · United States · 4 hours ago · 55 applicants\r\n$105K/yr - $108K/yr  Remote  Full-time  Associate\r\n51-200 employees · Software Development\r\n2 company alumni work here\r\n7 of 8 skills match your profile - you may be a good fit\r\nSee how you compare to 55 applicants. Try Premium for $0\r\n\r\nApply\r\n\r\nSave\r\nSave Applied Software Engineer II at Civis Analytics\r\nShare\r\nShow more options\r\nApplied Software Engineer II\r\nCivis Analytics United States Remote\r\n\r\nApply\r\n\r\nSave\r\nSave Applied Software Engineer II at Civis Analytics\r\nShow more options\r\nAbout the job\r\nAt Civis Analytics, we bring objective, data-driven truth to organizational decision-making—from the boardroom to the world’s largest progressive social causes.\r\nThis mission isn’t an aspiration: it’s something we see realized every day, and it brings purpose to everything we’re working on.\r\n\r\n\r\nWe combine a sophisticated SaaS product with our specialized data science consultancy to empower tens of thousands of active users to make millions of data-driven decisions every month. From joining disparate data sources and automating reporting, to building more elaborate models of targeted audiences and optimizing messages for them, organizations like the Bill and Melinda Gates Foundation, the City of Boston, and iHeart Radio trust Civis’s technology to make their most critical decisions.\r\n\r\n\r\nCore to our product and consulting offerings is Civis Platform, which makes it easy to import, manage, transform, analyze, and report on data with integrated open source tools. Our customers love Civis Platform because it empowers them to focus on finding data-driven answers to their most critical questions—in other words, we empower them to run their business, rather than running a tech stack. \r\n\r\n\r\n\r\nLearn more about Civis at www.civisanalytics.com.\r\n\r\n\r\nWhat we are looking for\r\n\r\nWe are looking for a software engineer to join the Applied Software Engineering team, partnering with our Data Scientists and Data Engineers to develop innovative software products tailored to solve the complex data problems for our clients. This team builds tools for decision makers to allocate resources and better communicate with the people most important to their business.\r\n\r\n\r\nWhat's great about being an engineer at Civis?\r\n\r\n\r\nWe staff projects based on what people will learn, not just who knows it best today. Engineers collaborate across departments with our data scientists and analysts who are not only the best and brightest in their fields, but are also eager to teach and learn from you. Finally, valuing continuous learning also means recognizing that our strongest contributors stand out for their capabilities and not their credentials. We are smart, fun, and a little bit weird.\r\n\r\n\r\nResponsibilities\r\n\r\nDevelop high-quality software\r\nSupport and collaborate with other engineers, designers, and product managers\r\nReview and debug code\r\nEffectively apply Civis best practices methodology and enforces design standards\r\nEnsure project documents are complete, current, and archived appropriately\r\nAbility to research, prototype and recommend software solutions\r\nCollaborate with other teams within the organization\r\nEngage the project on an emotional level as well as technical\r\n\r\n\r\nMinimum Qualifications\r\n\r\n2 - 4 years’ professional experience as a software developer/engineer\r\nExperience developing user interfaces with modern JavaScript frameworks\r\nComfort working with SQL databases\r\nExperience developing web applications with frameworks such as Rails or Django\r\nLove of problem-solving\r\nAn ability and eagerness to constantly learn and teach others\r\nPassion for solving large, complex problems for commercial clients\r\n\r\n\r\nPreferred Qualifications\r\n\r\nGraduate degree in Computer Science or a related subject\r\nSignificant experience with one or more of the following:\r\nReactJS, VueJS, AngularJS and/or similar JavaScript frameworks\r\nPython, Ruby, and/or Go (golang)\r\nDesigning and building APIs\r\nQuery optimization, database administration, analytics databases, and/or NoSQL\r\nAutomated software testing and continuous integration\r\nProficiency working with Amazon Web Services (AWS)\r\nData visualization for the web (using D3 or similar)\r\nStatistics and predictive modeling (using tools like pandas, scikit-learn, NumPy, SciPy, R, STATA)\r\nAll employees either must be fully vaccinated against COVID-19, initiate vaccination before your start date, or file an exemption request prior to start date per company policy for review. \r\n\r\n\r\nWho we are\r\n\r\nAt Civis, we have opportunities for applicants who are newcomers, seasoned professionals, and anywhere in between. Our teams are energized by complex challenges and value diversity of thought. Opportunities to stand out and inspire happen daily and we trust and encourage you to act on your ideas – no matter how big they are. We offer you the tools and community you need to do your best work. Each of us is committed to holding ourselves accountable for results, challenging the status quo and finding new ways to grow our company and each other.\r\n\r\n\r\nWhy Join our Team?\r\n\r\nSalary: $105,000 (a cost of living adjustment may be added for qualifying locations)\r\nThe opportunity to be part of a growing tech startup focused on solving interesting and meaningful problems, invested in internal promotion, and committed to fostering a diverse, equal and inclusive workplace. \r\nCompetitive benefits, including unlimited PTO, 401K match with immediate vesting, health, dental, and vision benefits, fully paid parental leave, commuter benefits, and pet insurance.\r\n\r\n\r\nCivis embraces the individuality of our employees, and we celebrate each other's differences. Our products, services, and culture benefit from and thrive on the unique perspectives brought by each person in our Civis community. We're proud to be an equal opportunity workplace, and we are committed to equal employment opportunity regardless of race, age, sex, color, ancestry, religion, national origin, sexual orientation, gender identity, citizenship, marital status, disability, or veteran status. If you have a disability or special need that requires accommodation, please contact us internalrecruiting@civisanalytics.com.\r\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States.\r\nEEO IS THE LAW\r\n\r\nEEO Supplement\r\n\r\nPay Transparency\r\n\r\nEmployer-provided\r\n\r\nPay range in United States\r\nExact compensation may vary based on skills, experience, and location.\r\n\r\nBase salary\r\n$105,000/yr - $108,000/yr", "skills": "JavaScript frameworks, SQL databases, web application development, problem-solving, continuous learning, software testing, AWS, data visualization, statistics, predictive modeling", "date": "2024-04-05", "id": 1, "summary": "At Civis Analytics, we are looking for a software engineer to join the Applied Software Engineering team. The role involves developing innovative software products tailored to solve complex data problems for clients. Responsibilities include developing high-quality software, collaborating with other team members, reviewing and debugging code, applying best practices methodology, and researching and recommending software solutions. The ideal candidate should have 2-4 years of professional experience as a software developer/engineer, experience with modern JavaScript frameworks, working with SQL databases, and developing web applications with frameworks such as Rails or Django. Preferred qualifications include a graduate degree in Computer Science, experience with JavaScript frameworks like ReactJS, VueJS, AngularJS, proficiency in Python, Ruby, or Go, designing and building APIs, working with AWS, data visualization, statistics, and predictive modeling."}]}