{"jobs": [{"title": "Software Engineer II", "company": "Google", "location": "USA", "description": "We are looking for a passionate Software Engineer to design, develop and install software solutions.\r\n\r\nSoftware Engineer responsibilities include gathering user requirements, defining system functionality and writing code in various languages, like Java, Ruby on Rails or .NET programming languages (e.g. C++ or JScript.NET.) Our ideal candidates are familiar with the software development life cycle (SDLC) from preliminary system analysis to tests and deployment.\r\n\r\nUltimately, the role of the Software Engineer is to build high-quality, innovative and fully performing software that complies with coding standards and technical design.", "date": "2024-01-27", "id": 1, "summary": "We're seeking a dedicated Software Engineer to join our team. The ideal candidate will be responsible for developing and implementing software solutions, gathering user requirements, and ensuring system functionality. Proficiency in languages like <mark>Java</mark>, <mark>Ruby on Rails</mark>, or <mark>.NET</mark> is essential. Candidates should have a strong grasp of the software development life cycle (SDLC) and be committed to delivering high-quality, innovative software that meets coding standards and technical specifications."}, {"title": "test", "company": "asdfsadf", "location": "sdafsadf", "description": "sfadfasdfasfasdf", "date": "2024-02-25", "id": 2, "summary": "We're seeking a dedicated Software Engineer to join our team. The ideal candidate will be responsible for developing and implementing software solutions, gathering user requirements, and ensuring system functionality. Proficiency in languages like <mark>Java</mark>, <mark>Ruby on Rails</mark>, or <mark>.NET</mark> is essential. Candidates should have a strong grasp of the software development life cycle (SDLC) and be committed to delivering high-quality, innovative software that meets coding standards and technical specifications."}]}